app/views/albums/_details.html.erb

SELECT "songs".* FROM "songs" INNER JOIN "tracks" ON "songs"."id" = "tracks"."song_id" WHERE "tracks"."album_id" = ?  [["album_id", 4]]
---
  <ul>
    <% @album.songs.each do |song| %>