app/controllers/albums_controller.rb

	def index
		@albums = Album.all

		if params[:keyword].present?
     	 @albums = @albums.where("title LIKE ? OR year = ?",
                                             "%#{params[:keyword]}%", params[:keyword])
    	end
		@albums = @albums.limit(100)
---
SELECT  "albums".* FROM "albums" LIMIT 100

	def create
		if Album.find_by(spotify_id:params[:spotifyid]) == nil
			@album = Album.new
		    @album.title = params[:title]
		    @album.image_url = params[:image_url]
		    @album.year = params[:year]
		    @album.popularity = params[:popularity]
		    @album.total_tracks = params[:total_tracks]
		    @album.album_type = params[:album_type]
		    @album.spotify_id = params[:spotifyid]
		    artist = Artist.find_by(spotify_id: params[:artist_sid])
		    if artist==nil
		    	spotifyartist = RSpotify::Artist.find(params[:artist_sid])
		    	artist = Artist.create(name:params[:artist],spotify_id:spotifyartist.id,photo_url: spotifyartist.images[1]['url'])
		    	spotifyartist.top_tracks('us').each do |top|
		    		Toptrack.create(name:top.name, preview_url:top.preview_url, artist_id:artist.id)
		    	end
		    end
				@album.artist_id = artist.id

		    if @album.save
		    	mtracks = RSpotify::Album.find(params[:spotifyid])
		    	mtracks.tracks.each do |song|
		    		@newsong = Song.new(name: song.name, runtime:song.duration_ms, album_id: @album.id, artist_id: artist.id, preview_url: song.preview_url,popularity: song.popularity)
		    		@newsong.save
---
INSERT INTO "artists" ("name") VALUES (?)  [["name", "Robin"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", "Robin"]]
INSERT INTO "tracks" ("song_id", "album_id") VALUES (?, ?)  [["song_id", 1], ["album_id", 4]]
INSERT INTO "albums" ("title", "image_url", "year", "artist_id") VALUES (?, ?, ?, ?)  [["title", "SUGAR"], ["image_url", "https://i.scdn.co/image/53fea48ae7ad87d8dea8fbf28ba2573b8a332a11"], ["year", 2015], ["artist_id", 1]]
INSERT INTO "songs" ("name", "runtime", "album_id", "artist_id", "preview_url") VALUES (?, ?, ?, ?, ?)  [["name", "Headlights (feat. Ilsey)"], ["runtime", 209208], ["album_id", 4], ["artist_id", 1], ["preview_url", "https://p.scdn.co/mp3-preview/3da874902a1076518f0d53347dd9638b154339e5"]]

	def destroy
		Album.delete(params[:id])
---
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 19]]