app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" LIMIT 50
---
  def index

     @artists = Artist.order('id ASC').reorder('name ASC')
     if params[:keyword].present?
       @artists = @artists.where("name LIKE ?","%#{params[:keyword]}%")
     end
     @artists = @artists.limit(50)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 17]]
---
  def show
     @artist = Artist.find_by(id: params[:id])