app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest") VALUES (?, ?, ?)  [["name", "Tianyu Song"], ["email", "songty@uchicago.edu"], ["password_digest", "$2a$10$UxO9bWcNX4HUjh5QV41xtuM//LljZRncOVwLJiLY48Jpya1BfqtUq"]]
---
  def create
    user = User.new
    user.name = params[:user][:name]
    user.email = params[:user][:email]
    user.password = params[:user][:password]
    user.image = "male_default.png"
    user.save